clase34-logg-performance/config.yml
config:
  plugins:
    metrics-by-endpoint: {}
  target: 'http://localhost:8080'
  phases:
    - duration: 20
      arrivalRate: 10  
scenarios: 
  - name: 'Sessions Flow (Register y login)'
    flow: 
      - log: 'Creamos un usuario de prueba'
      - get: 
          url: /pruebas/test/user
          capture: 
            - json: "$.first_name"
              as: "first_name"
            - json: "$.last_name"
              as: "last_name"
            - json: "$.email"
              as: "email"
            - json: "$.password"
              as: "password"
      - log: 'Registramos el usuario de prueba'
      - post: 
          url: /api/sessions/register
          json: 
            first_name: "{{first_name}}"
            last_name: "{{last_name}}"
            email: "{{email}}"
            password: "{{password}}"
      - think: 2
      - log: 'logueamos el usuario de prueba'
      - post: 
          url: /api/sessions/login
          json: 
            email: "{{email}}"
            password: "{{password}}"